import languages from "./languages"

export const devanagariDictionary = {
    'अ': 'a', 'आ': 'ā', 'इ': 'i', 'ई': 'ī', 'उ': 'u',
    'ऊ': 'ū', 'ऋ': 'ṛ', 'ॠ': 'ṝ', 'ऌ': 'ḷ', 'ॡ': 'ḹ',
    'ए': 'e', 'ऐ': 'ai', 'ओ': 'o', 'औ': 'au',

    'क': 'ka', 'ख': 'kha', 'ग': 'ga', 'घ': 'gha', 'ङ': 'ṅa',
    'च': 'ca', 'छ': 'cha', 'ज': 'ja', 'झ': 'jha', 'ञ': 'ña',
    'ट': 'ṭa', 'ठ': 'ṭha', 'ड': 'ḍa', 'ढ': 'ḍha', 'ण': 'ṇa',
    'त': 'ta', 'थ': 'tha', 'द': 'da', 'ध': 'dha', 'न': 'na',
    'प': 'pa', 'फ': 'pha', 'ब': 'ba', 'भ': 'bha', 'म': 'ma',
    'य': 'ya', 'र': 'ra', 'ल': 'la', 'व': 'va', 'श': 'śa',
    'ष': 'ṣa', 'स': 'sa', 'ह': 'ha',

    'क्ष': 'kṣa', 'त्र': 'tra', 'ज्ञ': 'jña',

    'अं': 'ṃ', 'अः': 'ḥ'
};
  
export const cyrillicDictionary = {
    'а': 'a', 'б': 'b', 'в': 'v',  'г': 'g', 'д': 'd',
    'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
    'й': 'y', 'к': 'k', 'л': 'l',  'м': 'm',  'н': 'n',
    'о': 'o', 'п': 'p', 'р': 'r',  'с': 's', 'т': 't',
    'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts','ч': 'ch',
    'ш': 'sh', 'щ': 'sch', 'ъ': "'",'ы': 'y','ь': '',
    'э': 'e',  'ю': 'yu',  'я': 'ya'
};
  
export const greekDictionary = {
    'α': 'a',  'β': 'v',  'γ': 'g',  'δ': 'd',  'ε': 'e',
    'ζ': 'z',  'η': 'i',  'θ': 'th', 'ι': 'i',  'κ': 'k',
    'λ': 'l',  'μ': 'm',  'ν': 'n',  'ξ': 'x',  'ο': 'o',
    'π': 'p',  'ρ': 'r',  'σ': 's',  'τ': 't',  'υ': 'y',
    'φ': 'ph', 'χ': 'ch', 'ψ': 'ps', 'ω': 'o',  'ά': 'a',
    'έ': 'e',  'ί': 'i',  'ό': 'o',  'ύ': 'y',  'ή': 'i',
    'ώ': 'o',  'ς': 's',  'ϊ': 'i',  'ΐ': 'i',  'ϋ': 'y',
    'ΰ': 'y',  'Α': 'A',  'Β': 'V',  'Γ': 'G',  'Δ': 'D',
    'Ε': 'E',  'Ζ': 'Z',  'Η': 'I',  'Θ': 'TH', 'Ι': 'I',
    'Κ': 'K',  'Λ': 'L',  'Μ': 'M',  'Ν': 'N',  'Ξ': 'X',
    'Ο': 'O',  'Π': 'P',  'Ρ': 'R',  'Σ': 'S',  'Τ': 'T',
    'Υ': 'Y',  'Φ': 'PH', 'Χ': 'CH', 'Ψ': 'PS', 'Ω': 'O',
    'Ά': 'A',  'Έ': 'E',  'Ί': 'I',  'Ό': 'O',  'Ύ': 'Y',
    'Ή': 'I',  'Ώ': 'O'
};
  
export const hebrewDictionary = {
    'א': 'a', 'ב': 'b', 'ג': 'g', 'ד': 'd', 'ה': 'h',
    'ו': 'v', 'ז': 'z', 'ח': 'kh', 'ט': 't', 'י': 'y',
    'כ': 'k', 'ל': 'l', 'מ': 'm', 'נ': 'n', 'ס': 's',
    'ע': '',  'פ': 'p', 'צ': 'ts', 'ק': 'q', 'ר': 'r',
    'ש': 'sh', 'ת': 't', 'ם': 'm', 'ן': 'n', 'ף': 'f',
    'ץ': 'tz', 'ך': 'kh', 'װ': 'v', 'ױ': 'v', 'ײ': 'y',
    'יִ': 'i', 'ﬡ': 'a', 'ﬢ': 'a', 'ﬣ': 'a', 'ﬤ': 'a',
    'ﬥ': 'a', 'ﬦ': 'a', 'ﬧ': 'o', 'ﬨ': 'e', '﬩': 'e',
    'שׁ': 'sh', 'שׂ': 's', 'שּׁ': 's', 'שּׂ': 't', 'אַ': 'a',
    'אָ': 'a', 'אּ': 'a', 'בּ': 'b', 'גּ': 'g', 'דּ': 'd',
    'הּ': 'h', 'וּ': 'v', 'זּ': 'z', 'טּ': 't', 'יּ': 'y',
    'ךּ': 'k', 'כּ': 'k', 'לּ': 'l', 'מּ': 'm', '﬿': 'm',
    'נּ': 'n', 'סּ': 's', 'ףּ': 'p', 'פּ': 'p', 'צּ': 'ts',
    'שּ': 'k', 'תּ': 't', 'וֹ': 'o', 'בֿ': 'v', 'כֿ': 'sh',
    'פֿ': 'f'
};

export const dictionaryMapping = {
    [languages[1]]: greekDictionary,
    [languages[2]]: devanagariDictionary,
    [languages[3]]: hebrewDictionary,
    [languages[4]]: cyrillicDictionary
}